Revit 2027 API
FillPattern.SetFillGrids Method
 Set the fill grids in this fill pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetFillGrids(
	IList<FillGrid> fillGrids
)
Public Sub SetFillGrids (
	fillGrids As IList(Of FillGrid)
)
public:
void SetFillGrids(
	IList<FillGrid^>^ fillGrids
)
member SetFillGrids :
        fillGrids : IList<FillGrid> -> unit
Parameters
fillGrids IList<FillGrid>
 The fill grids to be used.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FillPattern Class
Autodesk.Revit.DB Namespace